app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-05-02 19:38:29.484180"], ["updated_at", "2017-05-02 19:38:29.484180"]]
---
  def create
    @student = Student.create(params[:student])